---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Angle
source: html/d10348ad-ccde-c972-d1d4-1911ea40ae21.htm
---
# Autodesk.Revit.DB.SpecTypeId.Angle Property

Angle, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Angle { get; }
```